import java.util.ListResourceBundle;

/**
 * Created by danil on 22.06.2017.
 */
public class Locale_ru extends ListResourceBundle{
    @Override
    protected Object[][] getContents() {
        return new Object[][]{
                {"Остатки еды", "Остатки еды"},
                {"Имя", "Имя"},
                {"Вес", "Вес"},
                {"Дата создания", "Дата создания"},
                {"Безыменный", "Безыменный"},
                {"Фильтровать", "Фильтровать"},
                {"Информация", "Информация"},
                {"Очистить", "Очистить"},
                {"Удалить элементы", "Удалить элементы"},
                {"Выбрать файлы", "Выбрать файлы"},
                {"Сохранить", "Сохранить"},
                {"Фильтр имени", "Фильтр имени"},
                {"Фильтр веса", "Фильтр веса"},
                {"Фильтр даты", "Фильтр даты"},
                {"Хорошо", "Хорошо"},
                {"Отмена", "Отмена"},
                {"Цвет текста кнопок:", "Цвет текста кнопок:"},
                {"Редактирование таблицы:", "Редактирование таблицы:"},
                {"Да", "Да"},
                {"Нет", "Нет"},
                {"Размер шрифта кнопок:", "Размер шрифта кнопок:"},
                {"Сохранено.", "Сохранено."},
                {"Отменить", "Отменить"},
                {"По умолчанию", "По умолчанию"},
                {"Тип коллекции: ", "Тип коллекции: "},
                {"\nКоличество элементов: ", "\nКоличество элементов: "},
                {"Вы точно хотите удалить все элементы коллекции?", "Вы точно хотите удалить все элементы коллекции?"},
                {"Введите строку в формате json", "Введите строку в формате json"},
                {"Выберете файл или сохраните по умолчанию?", "Выберете файл или сохраните по умолчанию?"},
                {"Выбрать", "Выбрать"},
                {"Элемент уже существует", "Элемент уже существует"},
                {"Добавить", "Добавить"},
                {"Удалить", "Удалить"},
                {"Нет совпадений", "Нет совпадений"},
                {"1 из ", "1 из "},
                {" из ", " из "},
                {"Неверный формат фильтра", "Неверный формат фильтра"},
                {"Не удалось записать данные в xml-file", "Не удалось записать данные в xml-file"},
                {"Что-то не так с данными в файле. Проверьте их корректность.", "Что-то не так с данными в файле. Проверьте их корректность."},
                {"Файл не найден. Проверьте корректность пути.", "Файл не найден. Проверьте корректность пути."},
                {"Произошла неизвестная ошибка.", "Произошла неизвестная ошибка."},
        };
    }
}
